### SQL Connection

In [1]:
import mysql.connector as conn
import mysql.connector
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
myconn = conn.connect(host="localhost", user="bhagyalaxmi", passwd="root")

In [3]:
cursor = myconn.cursor()

###  Database and Table Creation

In [4]:
cursor.execute('show databases')
result = cursor.fetchall()
result

[('db',),
 ('employee_db',),
 ('employee_db1',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [5]:
cursor.execute('CREATE DATABASE IF NOT EXISTS employee_db')
cursor.execute('show databases')
result = cursor.fetchall()
result

[('db',),
 ('employee_db',),
 ('employee_db1',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [6]:
cursor.execute('CREATE DATABASE IF NOT EXISTS employee_db1')
cursor.execute('show databases')
result = cursor.fetchall()
result

[('db',),
 ('employee_db',),
 ('employee_db1',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [7]:
cursor.execute('use employee_db')
query = """
create table if not exists employees(
    employee_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    salary DECIMAL(8,2),
    department VARCHAR(50)
);
"""
cursor.execute(query)
myconn.commit()
cursor.execute('show tables')
cursor.fetchall()

[('employees',)]

### Table Creation with Constraints

Description:
Design a table named 'products' for storing product information. The table should have the following fields:
- product_id (integer, primary key)
- product_name (string, max length 100)
- price (decimal with 2 decimal places, not null)
- stock_quantity (integer, not null, default 0)
- category (string, max length 50)

In [9]:
cursor.execute('USE employee_db')

query_create_table_products = """
CREATE TABLE IF NOT EXISTS products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(100),
    price DECIMAL(8,2) NOT NULL,
    stock_quantity INT NOT NULL DEFAULT 0,
    category VARCHAR(50)
);
"""

cursor.execute(query_create_table_products)
myconn.commit()

cursor.execute('show tables')
cursor.fetchall()

[('employees',), ('products',)]

### Insert Records into 'employees' Table
Description: Given the 'employees' table with fields:
- employee_id (integer)
- first_name (string, max length 50)
- last_name (string, max length 50)
- salary (decimal with 2 decimal places)
- department (string, max length 50)
Insert 5 records into the 'employees' table with the following details:
1. Employee ID: 101, First Name: 'Ananya', Last Name: 'Kale', Salary: 60000.00, Department: 'HR'
2. Employee ID: 102, First Name: 'Pooja', Last Name: 'Patil', Salary: 75000.50, Department: 'IT'
3. Employee ID: 103, First Name: 'Anita', Last Name: 'Wagh', Salary: 80000.25, Department: 'Finance'
4. Employee ID: 104, First Name: 'Shital', Last Name: 'Dhongade', Salary: 70000.75, Department: 'Marketing'
5. Employee ID: 105, First Name: 'Shweta', Last Name: 'Panchal', Salary: 90000.50, Department: 'Sales'

In [10]:
# Use the 'employee_db' database
cursor.execute('USE employee_db')

# Insert 5 records into the 'employees' table with the provided data
query_insert_records = """
INSERT INTO employees (employee_id, first_name, last_name, salary, department)
VALUES
    (101, 'Ananya', 'Kale', 60000.00, 'HR'),
    (102, 'Pooja', 'Patil', 75000.50, 'IT'),
    (103, 'Anita', 'Wagh', 80000.25, 'Finance'),
    (104, 'Shital', 'Dhongade', 70000.75, 'Marketing'),
    (105, 'Shweta', 'Panchal', 90000.50, 'Sales');
"""

cursor.execute(query_insert_records)

# Commit the changes
myconn.commit()

# Extract the inserted records into a Pandas DataFrame
query_select_records = "SELECT * FROM employees;"
data_inserted = pd.read_sql_query(query_select_records, myconn)

print("Inserted Records:")
data_inserted.head()

Inserted Records:

   employee_id first_name last_name    salary department
0          101     Ananya      Kale  60000.00         HR
1          102      Pooja     Patil  75000.50         IT
2          103      Anita      Wagh  80000.25    Finance
3          104     Shital  Dhongade  70000.75  Marketing
4          105     Shweta   Panchal  90000.50      Sales

### Extract Records with Salary Within a Range
Description: Given the 'employees' table with fields:
- employee_id (integer)
- first_name (string, max length 50)
- last_name (string, max length 50)
- salary (decimal with 2 decimal places)
- department (string, max length 50)
Extract records from the 'employees' table where the salary falls within the range of 70000 to 80000.

In [11]:
# Use the 'employee_db' database
cursor.execute('USE employee_db')

# Extract records with salary within the range of 70000 to 80000
query_salary_range = """
SELECT *
FROM employees
WHERE salary BETWEEN 70000.00 AND 80000.00;
"""

data_salary_range = pd.read_sql_query(query_salary_range, myconn)

print("Records with Salary Within 70000 to 80000 Range:")
data_salary_range.head()

Records with Salary Within 70000 to 80000 Range:

   employee_id first_name last_name    salary department
0          102      Pooja     Patil  75000.50         IT
1          104     Shital  Dhongade  70000.75  Marketing

### Delete Records with Specific Conditions
Description: Given the 'employees' table with fields:
- employee_id (integer)
- first_name (string, max length 50)
- last_name (string, max length 50)
- salary (decimal with 2 decimal places)
- department (string, max length 50)
Delete records from the 'employees' table where either the first_name is 'Pooja' or the salary is less than 75000.

In [12]:
# Use the 'employee_db' database
cursor.execute('USE employee_db')

# Delete records with specific conditions
query_delete_records = """
DELETE FROM employees
WHERE first_name = 'Pooja' OR salary < 75000.00;
"""

cursor.execute(query_delete_records)

# Commit the changes
myconn.commit()

# Verify the deletion by fetching and displaying the remaining data
query_select_remaining = "SELECT * FROM employees;"
data_remaining = pd.read_sql_query(query_select_remaining, myconn)

print("Remaining Records:")
data_remaining.head()

Remaining Records:

   employee_id first_name last_name    salary department
0          103      Anita      Wagh  80000.25    Finance
1          105     Shweta   Panchal  90000.50      Sales

### Given the 'country' table with fields:

- Code (string, max length 3)
- Name (string, max length 52)
- Continent (string, max length 13)
- Population (integer)

Select the top 5 countries with the highest population

In [14]:
# Use the 'world' database
cursor.execute('USE world')

# Select the top 5 countries by population
query_top_countries = """
SELECT *
FROM country
ORDER BY Population DESC
LIMIT 5;
"""

data_top_countries = pd.read_sql_query(query_top_countries, myconn)

print("Top 5 Countries by Population:")
data_top_countries.head()

Top 5 Countries by Population:

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,CHN,China,Asia,Eastern Asia,9572900.0,-1523,1277558000,71.4,982268.0,917719.0,Zhongquo,People'sRepublic,Jiang Zemin,1891,CN
1,IND,India,Asia,Southern and Central Asia,3287263.0,1947,1013662000,62.5,447114.0,430572.0,Bharat/India,Federal Republic,Kocheril Raman Narayanan,1109,IN
2,USA,United States,North America,North America,9363520.0,1776,278357000,77.1,8510700.0,8110900.0,United States,Federal Republic,George W. Bush,3813,US
3,IDN,Indonesia,Asia,Southeast Asia,1904569.0,1945,212107000,68.0,84982.0,215002.0,Indonesia,Republic,Abdurrahman Wahid,939,ID
4,BRA,Brazil,South America,South America,8547403.0,1822,170115000,62.9,776739.0,804108.0,Brasil,Federal Republic,Fernando Henrique Cardoso,211,BR

###  Given the 'city' table with fields:

ID (integer)
Name (string, max length 35)
CountryCode (string, max length 3)
District (string, max length 20)
Population (integer)
Select cities where the population is between 500,000 and 1,000,000, ordered by population in descending order.

In [15]:
# Use the 'world' database
cursor.execute('USE world')

# Select cities with population between 500,000 and 1,000,000
query_population_range = """
SELECT *
FROM city
WHERE Population BETWEEN 500000 AND 1000000
ORDER BY Population DESC;
"""

data_population_range = pd.read_sql_query(query_population_range, myconn)

print("Cities with Population Between 500,000 and 1,000,000:")
data_population_range.head()

Cities with Population Between 500,000 and 1,000,000:

     ID       Name CountryCode              District  Population
0  1786      Amman         JOR                 Amman     1000000
1  3214  Mogadishu         SOM              Banaadir      997000
2  3592  Volgograd         RUS             Volgograd      993400
3  1543     Sendai         JPN                Miyagi      989975
4  2829   Peshawar         PAK  Nothwest Border Prov      988005

### Given the 'country' table with fields:
- Code (string, max length 3)
- Name (string, max length 52)
- Continent (string, max length 13)
- Population (integer)
Select the continent with the highest average population.

In [16]:
# Use the 'world' database
cursor.execute('USE world')

# Select the continent with the highest average population
query_continent_avg_population = """
SELECT Continent, AVG(Population) AS AvgPopulation
FROM country
GROUP BY Continent
ORDER BY AvgPopulation DESC
LIMIT 1;
"""

data_continent_avg_population = pd.read_sql_query(query_continent_avg_population, myconn)

print("Continent with Highest Average Population:")
data_continent_avg_population.head()

Continent with Highest Average Population:

  Continent  AvgPopulation
0      Asia   7.264756e+07

### Given the 'country' table with fields:
- Code (string, max length 3)
- Name (string, max length 52)
- Continent (string, max length 13)
- Population (integer)
Select the top 3 continents with the highest total population.

In [17]:
# Use the 'world' database
cursor.execute('USE world')

# Select the top 3 continents by total population
query_top_continents = """
SELECT Continent, SUM(Population) AS TotalPopulation
FROM country
GROUP BY Continent
ORDER BY TotalPopulation DESC
LIMIT 3;
"""

data_top_continents = pd.read_sql_query(query_top_continents, myconn)

print("Top 3 Continents by Total Population:")
data_top_continents.head()

Top 3 Continents by Total Population:

  Continent  TotalPopulation
0      Asia     3.705026e+09
1    Africa     7.844750e+08
2    Europe     7.300746e+08

### Given the 'city' table with fields:
- ID (integer)
- Name (string, max length 35)
- CountryCode (string, max length 3)
- District (string, max length 20)
- Population (integer)
Select cities with a population greater than the average population

In [19]:
# Use the 'world' database
cursor.execute('USE world')

# Select cities with population greater than the average population
query_population_above_avg = """
SELECT *
FROM city
WHERE Population > (SELECT AVG(Population) FROM city);
"""

data_population_above_avg = pd.read_sql_query(query_population_above_avg, myconn)

print("Cities with Population Greater Than Average:")
data_population_above_avg.head()

Cities with Population Greater Than Average:

   ID       Name CountryCode       District  Population
0   1      Kabul         AFG          Kabol     1780000
1   5  Amsterdam         NLD  Noord-Holland      731200
2   6  Rotterdam         NLD   Zuid-Holland      593321
3   7       Haag         NLD   Zuid-Holland      440900
4  35      Alger         DZA          Alger     2168000